package com.example.Question;

import com.example.Db.DbShuZiTiBianLiang;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by qxx on 2017/5/23.
 */

public class QueName {
    public String listName[][]={

            {"0","神创造的第一个人叫什么名字？",
                    "亚当","夏娃","耶稣","挪亚",
                    "0","正确答案：亚当\n创2:18 耶和华神说，那人独居不好，我要为他造一个配偶帮助他。\n" +
                    "创2:19 耶和华神用土所造成的野地各样走兽和空中各样飞鸟都带到那人面前，看他叫什么。那人怎样叫各样的活物，那就是它的名字。\n" +
                    "创2:20 那人便给一切牲畜和空中飞鸟，野地走兽都起了名。只是那人没有遇见配偶帮助他。\n" +
                    "创2:21 耶和华神使他沉睡，他就睡了。于是取下他的一条肋骨，又把肉合起来。\n" +
                    "创2:22 耶和华神就用那人身上所取的肋骨，造成一个女人，领她到那人跟前。\n" +
                    "创2:23 那人说，这是我骨中的骨，肉中的肉，可以称她为女人，因为她是从男人身上取出来的。" +
                    "创3:20 亚当给他妻子起名叫夏娃，因为她是众生之母。"},
            {"2","谁造的方舟？",
                    "亚当","该隐","挪亚","摩西",
                    "2","正确答案：挪亚\n创6:13 神就对挪亚说，凡有血气的人，他的尽头已经来到我面前。因为地上满了他们的强暴，我要把他们和地一并毁灭。\n" +
                    "你要用歌斐木造一只方舟，分一间一间地造，里外抹上松香。"},
            {"3","亚伯拉罕又叫什么？",
                    "亚伯","亚伯拉","拉罕","亚伯兰",
                    "3","正确答案：亚伯兰\n创17:3 亚伯兰俯伏在地。神又对他说，\n" +
                    "创17:4 我与你立约，你要作多国的父。\n" +
                    "创17:5 从此以后，你的名不再叫亚伯兰，要叫亚伯拉罕，因为我已立你作多国的父。\n" +
                    "创17:6 我必使你的后裔极其繁多。国度从你而立，君王从你而出。\n" +
                    "创17:7 我要与你并你世世代代的后裔坚立我的约，作永远的约，是要作你和你后裔的神。\n" +
                    "创17:8 我要将你现在寄居的地，就是迦南全地，赐给你和你的后裔永远为业，我也必作他们的神。\n" +
                    "创17:9 神又对亚伯拉罕说，你和你的后裔，必世世代代遵守我的约。"},
            {"4","亚伯拉罕的妻子是谁？",
                    "撒拉","拉莱","利百加","夏娃",
                    "0","正确答案：撒拉\n创17:15 神又对亚伯拉罕说，你的妻子撒莱，不可再叫撒莱，她的名要叫撒拉。"},
            {"5","雅各的另一个名字是什么？",
                    "以扫","以色列","抓住","以撒",
                    "1","正确答案：以色列\n创32:27 那人说，你名叫什么？他说，我名叫雅各。\n" +
                    "那人说，你的名不要再叫雅各，要叫以色列。因为你与神与人较力，都得了胜。"},
            {"6","谁带领以色列民出埃及？",
                    "约书亚","亚伦","摩西","耶和华",
                    "3","正确答案：耶和华\n出12:40 以色列人住在埃及共有四百三十年。\n" +
                    "出12:41 正满了四百三十年的那一天，耶和华的军队都从埃及地出来了。\n" +
                    "出12:42 这夜是耶和华的夜，因耶和华领他们出了埃及地，所以当向耶和华谨守，是以色列众人世世代代该谨守的。"},
            {"7","摩西的母亲是谁？",
                    "以利沙巴","暗兰","隐罗结","约基别",
                    "3","正确答案：约基别\n民26:59 暗兰的妻名叫约基别，是利未女子，生在埃及。她给暗兰生了亚伦，摩西，并他们的姐姐米利暗。"},
            {"8","约瑟的同父同母的弟弟叫什么名字？",
                    "便雅悯","以萨迦","但","亚设",
                    "0","正确答案：便雅悯\n约瑟和便雅悯都是拉结所生的儿子，拉结也只有这两个儿子，经文请参考：\n雅各共有十二个儿子。创35:23 利亚所生的是雅各的长子流便，还有西缅，利未，犹大，以萨迦，西布伦。\n" +
                    "创35:24 拉结所生的是约瑟，便雅悯。\n" +
                    "创35:25 拉结的使女辟拉所生的是但，拿弗他利。\n" +
                    "创35:26 利亚的使女悉帕所生的是迦得，亚设。这是雅各在巴旦亚兰所生的儿子。"},
            {"9","下面哪一个不是亚伦的儿子？",
                    "亚比户","以利加拿","以利亚撒","以他玛",
                    "1","正确答案：以利加拿\n出6:23 亚伦娶了亚米拿达的女儿，拿顺的妹妹，以利沙巴为妻，她给他生了拿答，亚比户，以利亚撒，以他玛。" +
                    "出6:24 可拉的儿子是亚惜，以利加拿，亚比亚撒，这是可拉的各家。\n" +
                    "由此可见，以利加拿是可拉的儿子"},
            {"10","谁带领以色列民进入的迦南？",
                    "摩西","亚伦","约书亚","扫罗",
                    "2","正确答案：约书亚\n摩西死后，约书亚接续摩西的工作，带领以色列民进入了迦南\n" +
                    "参考经文：申31:3 耶和华你们的神必引导你们过去，将这些国民在你们面前灭绝，你们就得他们的地。约书亚必引导你们过去，正如耶和华所说的。"},
            {"11","谁打死的歌利亚？",
                    "参孙","扫罗","撒母耳","大卫",
                    "3","正确答案：大卫\n撒上17:49 大卫用手从囊中掏出一块石子来，用机弦甩去，打中非利士人的额，石子进入额内，他就仆倒，面伏于地。\n" +
                    "撒上17:50 这样，大卫用机弦甩石，胜了那非利士人，打死他。大卫手中却没有刀。\n" +
                    "撒上17:51 大卫跑去，站在非利士人身旁，将他的刀从鞘中拔出来，杀死他，割了他的头。非利士众人看见他们讨战的勇士死了，就都逃跑。"},
            {"12","圣经中记载寿命最长的人是谁？",
                    "玛土撒拉","雅列","挪亚","亚当",
                    "0","正确答案：玛土撒拉\n玛土撒拉：969岁\n雅列：962岁，排名第二\n挪亚：950岁，排名第三\n亚当：930岁，排名第四"},
            {"13","方舟降落在哪座山上？",
                    "黑门山","亚拉腊山","何烈山","西奈山",
                    "1","正确答案：亚拉腊山\n创8:4 七月十七日，方舟停在亚拉腊山上。"},
            {"14","有一次，挪亚喝醉了酒，酒醒后咒诅了谁？",
                    "闪","含","雅弗","迦南",
                    "3","正确答案：迦南\n创9:24 挪亚醒了酒，知道小儿子向他所作的事，\n" +
                    "创9:25 就说，迦南当受咒诅，必给他弟兄作奴仆的奴仆。\n\n注意，迦南其实是含的儿子，挪亚的孙子。"},
            {"15","古代人曾想建造一座塔，塔顶通天，这座塔的名字是？",
                    "巴别","通天塔","高塔","留名塔",
                    "0","正确答案：巴别塔\n参见创世记11章1-9节。"},
            {"16","亚伯拉罕的父亲叫什么名字？","拿鹤","他拉","哈兰","拉吴","1","正确答案：他拉\n创11:26 他拉活到七十岁，生了亚伯兰，拿鹤，哈兰。\n\n注意：亚伯兰就是亚伯拉罕"},
            {"17","亚伯拉罕离开家乡哈兰后，走到了哪里？","迦勒底","巴比伦","迦南","埃及","2","正确答案：迦南\n创12:5 亚伯兰将他妻子撒莱和侄儿罗得，连他们在哈兰所积蓄的财物，所得的人口，都带往迦南地去。他们就到了迦南地。"},
            {"18","亚伯拉罕听见罗得被掳去，追到哪里才将罗得救回来？","但","大马色","沙微","何把","3","正确答案：何把\n创14:14 亚伯兰听见他侄儿（原文作弟兄）被掳去，就率领他家里生养的精练壮丁三百一十八人，直追到但，\n" +
                    "创14:15 便在夜间，自己同仆人分队杀败敌人，又追到大马色左边的何把，\n" +
                    "创14:16 将被掳掠的一切财物夺回来，连他侄儿罗得和他的财物，以及妇女，人民也都夺回来。"},
            {"19","亚伯拉罕出哈兰的时候，有一个侄子与他同去，亚伯拉罕侄子的名字是？","罗得","拿鹤","他拉","拉吴","0","正确答案：罗得\n创12:4 亚伯兰就照着耶和华的吩咐去了。罗得也和他同去。亚伯兰出哈兰的时候，年七十五岁。\n" +
                    "创12:5 亚伯兰将他妻子撒莱和侄儿罗得，连他们在哈兰所积蓄的财物，所得的人口，都带往迦南地去。他们就到了迦南地。"},
            {"20","亚伯拉罕的妻子撒莱有个使女，名叫什么？","利百加","夏甲","尼拜约","阿何利巴玛","1","正确答案：夏甲\n创16:1 亚伯兰的妻子撒莱不给他生儿女。撒莱有一个使女，名叫夏甲，是埃及人。"},
            {"21","亚伯拉罕的妾夏甲有一个儿子叫什么？",
                    "以撒","雅各","以实玛利","以扫","2","正确答案：以实玛利\n创16:15 后来夏甲给亚伯兰生了一个儿子。亚伯兰给他起名叫以实玛利。"},
            {"22","雅各的舅舅叫什么名字？",
                    "彼土利","以扫","拉班","罗得",
                    "3","正确答案：拉班\n创29:10 雅各看见母舅拉班的女儿拉结和母舅拉班的羊群，就上前把石头转离井口，饮他母舅拉班的羊群。\n" +
                    "创29:11 雅各与拉结亲嘴，就放声而哭。\n" +
                    "创29:12 雅各告诉拉结，自己是她父亲的外甥，是利百加的儿子，拉结就跑去告诉她父亲。\n" +
                    "创29:13 拉班听见外甥雅各的信息，就跑去迎接，抱着他，与他亲嘴，领他到自己的家。雅各将一切的情由告诉拉班。"},
            {"23","以撒的妻子叫什么？","利百加","拉结","基土拉","尼拜约","0","正确答案：利百加\n在创世记24章，完整的记载了以撒娶妻的经过，也成为我们婚姻的典范，建议仔细阅读一下哟！"},
            {"24","雅各梦见天梯后，给那个地方起名叫什么？","路斯","伯特利","伯利恒","别是巴","1","正确答案：伯特利\n创28:19 他就给那地方起名" +
                    "叫伯特利（就是神殿的意思）。但那地方起先名叫路斯。\n\n" +
                    "完整故事如下：\n" +
                    "\n创28:10 雅各出了别是巴，向哈兰走去。\n" +
                    "创28:11 到了一个地方，因为太阳落了，就在那里住宿，便拾起那地方的一块石头枕在头下，在那里躺卧睡了，\n" +
                    "创28:12 梦见一个梯子立在地上，梯子的头顶着天，有神的使者在梯子上，上去下来。\n" +
                    "创28:13 耶和华站在梯子以上（或作站在他旁边），说，我是耶和华你祖亚伯拉罕的神，也是以撒的神。我要将你现在所躺卧之地赐给你和你的后裔。\n" +
                    "创28:14 你的后裔必像地上的尘沙那样多，必向东西南北开展。地上万族必因你和你的后裔得福。\n" +
                    "创28:15 我也与你同在。你无论往哪里去，我必保佑你，领你归回这地，总不离弃你，直到我成全了向你所应许的。\n" +
                    "创28:16 雅各睡醒了，说，耶和华真在这里，我竟不知道。\n" +
                    "创28:17 就惧怕，说，这地方何等可畏，这不是别的，乃是神的殿，也是天的门。\n" +
                    "创28:18 雅各清早起来，把所枕的石头立作柱子，浇油在上面。\n" +
                    "创28:19 他就给那地方起名叫伯特利（就是神殿的意思）。但那地方起先名叫路斯。"},
            {"25","雅各娶到的第一个妻子是谁？","辟拉","悉帕","利亚","拉结","2","正确答案：利亚\n事情是这样的：雅各非常喜欢拉结，就为了拉结服侍了拉班七年，可是" +
                    "到时候拉班却欺骗了他，把利亚给了他为妻"},
            {"26","雅各有一个女儿名叫什么？是哪个妻子给雅各生的？","尼拜约、拉结","尼拜约、利亚","底拿、拉结","底拿、利亚","3","正确答案：底" +
                    "拿、利亚\n创34:1 利亚给雅各所生的女儿底拿出去，要见那地的女子们。"},
            {"27","以扫的子孙中，谁在旷野放驴的时候遇到了温泉？","亚拿","亚雅","祭便","朔巴","0","正确答案：亚拿\n创36:24 祭" +
                    "便的儿子是亚雅，亚拿。当时在旷野放他父亲祭便的驴，遇着温泉的，就是这亚拿。"},
            {"28","雅各（以色列）最爱他十二个儿子中的哪一个？","便雅悯","约瑟","犹大","利未","1","正确答案：约瑟\n创37:3 以色列原来爱约瑟过于爱他的众子，因为约瑟是他年老生的。他给约瑟作了一件彩衣。"},
            {"29","埃及法老给了约瑟一个妻子，名字是？","撒发那忒巴内亚","波提非拉","亚西纳","波提乏","2","正确答案：亚西纳\n" +
                    "创41:45 法老赐名给约瑟，叫撒发那忒巴内亚，又将安城的祭司波提非拉的女儿亚西纳给他为妻。约瑟就出去巡行埃及地。"},
            {"30","约瑟的哥哥们第一次来买粮食的时候，约瑟把谁捆绑留了下来？","犹大","利未","流便","西缅","3","" +
                    "正确答案：西缅\n创42:24 约瑟转身退去，哭了一场，又回来对他们说话，就从他们中间挑出西缅来，在他们眼前把他捆绑。"},
            {"31","约瑟有两个儿子，一个是以法莲，另一个是__？","玛拿西","拿弗他利","亚设","以萨迦","0","正确" +
                    "答案：玛拿西\n创46:20 约瑟在埃及地生了玛拿西和以法莲，就是安城的祭司波提非拉的女儿亚西纳给约瑟生的。"},
            {"32","约瑟有两个儿子，一个是玛拿西，另一个是__？","拿弗他利","以法莲","亚设","以萨迦","1","正确" +
                    "答案：以法莲\n创46:20 约瑟在埃及地生了玛拿西和以法莲，就是安城的祭司波提非拉的女儿亚西纳给约瑟生的。"},
            {"33","以色列全家到埃及后住在哪片地上？",
                    "书珊","幔利","歌珊地","迦南地",
                    "2","正确答案：" +
                    "歌珊地\n创47:1 约瑟进去告诉法老说，我的父亲和我的弟兄带着羊群牛群，并一切所有的，从迦南地来了，如今在歌珊地。"},
            {"34","雅各在临死之前给他儿子们祝福的时候把犹大比作什么？",
                    "狼","母鹿","驴","狮子",
                    "3","正确答案：狮子\n" +
                    "创49:9 犹大是个小狮子。我儿阿，你抓了食便上去。你屈下身去，卧如公狮，蹲如母狮，谁敢惹你。"},
            {"35","雅各在临死之前给他儿子们祝福的时候把便雅悯比作什么？",
                    "狼","母鹿","驴","狮子",
                    "0","正确答案：狼\n" +
                    "创49:27 便雅悯是个撕掠的狼，早晨要吃他所抓的，晚上要分他所夺的。"},
            {"36","雅各在临死之前给他儿子们祝福的时候把拿弗他利比作什么？",
                    "狼","母鹿","驴","狮子",
                    "1","正确答案：母鹿\n" +
                    "创49:21 拿弗他利是被释放的母鹿。他出嘉美的言语。"},
            {"37","雅各在临死之前给他儿子们祝福的时候把以萨迦比作什么？",
                    "狼","母鹿","驴","狮子",
                    "2","正确答案：驴\n" +
                    "创49:14 以萨迦是个强壮的驴，卧在羊圈之中。"},
//            {"","","","","","","3",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},

    };
    //将问题数组String listName 添加进list中
    public List<DbShuZiTiBianLiang> AddQuestionName(){
        List<DbShuZiTiBianLiang> list1=new ArrayList<>();


        for(int i=0;i<listName.length;i++){
            DbShuZiTiBianLiang bianliang=new DbShuZiTiBianLiang();

            //获得问题的序号、标题、选项、正确答案及解析
            bianliang.DingyiId=Integer.parseInt(listName[i][0]);
            bianliang.Dingyique=listName[i][1];
            bianliang.DingyiA=listName[i][2];
            bianliang.DingyiB=listName[i][3];
            bianliang.DingyiC=listName[i][4];
            bianliang.DingyiD=listName[i][5];
            //QueRightAnswer的值应该在0-3之间，分别对应ABCD
            bianliang.DingyiRightanswer= Integer.parseInt(listName[i][6]);
            bianliang.DingyiExplain=listName[i][7];
            bianliang.DingyiSelectedAnswer=-1;
            list1.add(bianliang);
        }

        return list1;

    }

//    //传入参数，生成随机数组，参数l为所有数据库中问题的个数
//    public int  GetRandomNumber(int l){
//        Random q=new Random();
//        int a=q.nextInt(l);
//        return a;
//    }
    //调用此方法可以在不遍历数据库的前提下获得数据库中问题的个数
    public int AddQueNameLen(){
        return listName.length;
    }
}
