package com.example.Question;

import com.example.Db.DbShuZiTiBianLiang;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;

/**
 * Created by qxx on 2017/5/20.
 */

public class QueShuZi {
    public String listShuzi[][]={
            {"0","耶稣有几个门徒？","11","12","13","14","1","正确答案：12个\n太10:1 耶稣叫了十二个门徒来，给他们权柄，能赶逐污鬼，并医治各样的病症。\n" +
                    "太10:2 这十二使徒的名，头一个叫西门，又称彼得，还有他兄弟安得烈。西庇太的儿子雅各，和雅各的兄弟约翰。\n" +
                    "太10:3 腓力，和巴多罗买，多马，和税吏马太，亚勒腓的儿子雅各，和达太。\n" +
                    "太10:4 奋锐党的西门，还有卖耶稣的加略人犹大。\n" +
                    ""},
            {"1","耶稣多少岁上十字架？","30","35","33","40","2","正确答案：33岁\n答案见四福音书及但以理书。这道题答对很容易，因为大家都公认是33岁，但从圣经中找依据还是需要下功夫的哟！"},
            {"2","神创造天地用了几天","4","5","6","7","2","正确答案：六天\n创2:1 天地万物都造齐了。\n" +
                    "创2:2 到第七日，神造物的工已经完毕，就在第七日歇了他一切的工，安息了。\n" +
                    "创2:3 神赐福给第七日，定为圣日，因为在这日神歇了他一切创造的工，就安息了。\n" +
                    "注意，第七天不算，神已经安息了"},
            {"3","以色列民在埃及住了多少年？","400年","410年","420年","430年","3","正确答案：430年\n出12:40 以色列人住在埃及共有四百三十年。\n" +
                    "出12:41 正满了四百三十年的那一天，耶和华的军队都从埃及地出来了。\n" +
                    "出12:42 这夜是耶和华的夜，因耶和华领他们出了埃及地，所以当向耶和华谨守，是以色列众人世世代代该谨守的。"},
            {"4","以色列民出埃及后多少年才进到迦南？","4年","7年","38年","40年","3","正确答案：40年\n申8:2 你也要记念耶和华你的神在旷野引导你这四十年，是要苦炼你，试验你，要知道你心内如何，肯守他的诫命不肯。"},
            {"5","圣经一共有多少卷书？","69","66","62","60","1","正确答案：66卷\n其中，新约有27卷，旧约有39卷"},
            {"6","雅各有几个儿子？","11个","12个","13个","10个","1","正确答案：12个\n分别是：\n" +
                    "流便，西缅，利未，犹大，以萨迦，西布伦。\n" +
                    "约瑟，便雅悯。\n" +
                    "但，拿弗他利。\n" +
                    "迦得，亚设。"},
            {"7","摩西写了几卷圣经？","5卷","4卷","3卷","2卷","0","正确答案：五卷\n分别是：创世记、出埃及记、利未记、民数记、申命记"},
            {"8","最长的一篇诗篇是第几篇？","51篇","69篇","18篇","119篇","3","正确答案：119篇\n119篇最长，有176节，18篇为第二长"},
            {"9","约书亚在世一共打败了多少个迦南王？","34个","33个","32个","31个","3","正确答案：31个\n约书亚记12:24节：共计三十一个王"},
            {"10","“耶和华是我的牧者，我必不至缺乏”这句话出自哪一篇诗篇？","23篇","150篇","第一篇","90篇","0","正确答案：23篇第一节\n"},
            {"11","耶和华所恨恶的，连他心所恨恶的，一共有几样？","5样","6样","7样","8样","2","正确答案：七样\n箴6:16 耶和华所恨恶的有六样，连他心所憎恶的共有七样。\n" +
                    "箴6:17 就是高傲的眼，撒谎的舌，流无辜人血的手，\n" +
                    "箴6:18 图谋恶计的心，飞跑行恶的脚，\n" +
                    "箴6:19 吐谎言的假见证，并弟兄中布散分争的人。"},
            {"12","但以理有几个朋友被扔到了火窑当中？","1","2","3","4","2","正确答案：三个\n他们的名字是：沙得拉，米煞，亚伯尼歌"},
            {"13","耶稣开始传道时多少岁？","30","31","32","33","0","正确答案：三十岁\n路3:23 耶稣开头传道，年纪约有三十岁"},
            {"14","圣经中记载寿命最长的人活了多少岁？","966","969岁","996","999","1","正确答案：969岁\n创世记5:27 玛土撒拉共活了九百六十九岁就死了。"},
            {"15","挪亚在洪水之前生了几个儿子？","1个","2个","3个","4个","2","正确答案：三个\n创6:10 挪亚生了三个儿子，就是闪，含，雅弗。"},
            {"16","挪亚世代发洪水的时候挪亚多少岁？","620岁","550岁","500岁","600岁","3","正确答案：600岁\n创7:6 当洪水泛滥在地上的时候，挪亚整六百岁。"},
            {"17","进入方舟的一共有几个人？","8","7","9","10","0","正确答案：八个人\n创7:13 正当那日，挪亚和他三个儿子闪，含，雅弗，并挪亚的妻子和三个儿妇，都进入方舟。"},
            {"18","挪亚世代发洪水时大雨下了多少天？","30天","40天","70天","180天","1","正确答案：四十天\n创7:11 当挪亚六百岁，二月" +
                    "十七日那一天，大渊的泉源都裂开了，天上的窗户也敞开了。\n" +
                    "创7:12 四十昼夜降大雨在地上。"},
            {"19","洪水以后，挪亚又活了多少年？","300年","330年","350年","400年","2","正确答案：350年\n创9:28 洪水以后，挪亚又活了三百五十年。"},
            {"20","亚伯拉罕出哈兰的时候，多少岁？","70","72","74","75","3","创12:4 亚伯兰出哈兰的时候，年七十五岁。"},
            {"21","亚伯拉罕听见罗得被掳去时，率领了多少壮丁去解救罗得？","318","319","320","321","0","正确答案：318\n创14:14 亚伯兰听见他侄儿（原文作弟兄）被掳去，就率领他家里生养的精练壮丁三百一十八人，直追到但"},
            {"22","夏甲给亚伯兰生以实玛利的时候，亚伯兰多少岁？","84","86","88","90","1","正确答案：86\n创16:16 夏甲给亚伯兰生以实玛利的时候，亚伯兰年八十六岁。"},
            {"23","亚伯拉罕受割礼时多少岁？","95","97","99","100","2","正确答案：九十九岁\n创17:24 亚伯拉罕受割礼的时候，年九十九岁。"},
            {"24","以扫一共取了几个妻子？","6个","5个","4个","3个","3","正确答案：三个\n名字分别是：亚大，阿何利巴玛，巴实抹\n圣经经文请参考创世记36:1-3节:\n" +
                    "创36:1 以扫就是以东，他的后代记在下面。\n" +
                    "创36:2 以扫娶迦南的女子为妻，就是赫人以伦的女儿亚大和希未人祭便的孙女，亚拿的女儿阿何利巴玛，\n" +
                    "创36:3 又娶了以实玛利的女儿，尼拜约的妹子巴实抹。"},
            {"25","雅各的舅舅拉班有几个女儿？","0","1","2","3","2","正确答案：两个\n创29:16 拉班有两个女儿，大的名叫利亚，小的名叫拉结。"},
            {"26","雅各为了得到拉结一共付出了多少年的时光？","14","10","7","4","0","正确答案：14年\n事情是这样的：雅各非常喜欢拉结，就为了拉结服侍了拉班七年，可是" +
                    "到时候拉班却欺骗了他，把利亚给了他为妻。雅各无奈，为了得到拉结，只得答应再服侍拉班七年。"},
            {"27","雅各在他舅舅拉班家一共多少年？","14","20","25","30","1","正确答案：20年\n创31:36 雅各就发怒斥责拉班说，我有什么过犯，有什么罪恶，你竟这样火速地追我？\n" +
                    "创31:37 你摸遍了我一切的家具，你搜出什么来呢？可以放在你我弟兄面前，叫他们在你我中间辨别辨别。\n" +
                    "创31:38 我在你家这二十年，你的母绵羊，母山羊没有掉过胎。你群中的公羊，我没有吃过。\n" +
                    "创31:39 被野兽撕裂的，我没有带来给你，是我自己赔上。无论是白日，是黑夜，被偷去的，你都向我索要。\n" +
                    "创31:40 我白日受尽干热，黑夜受尽寒霜，不得合眼睡着，我常是这样。\n" +
                    "创31:41 我这二十年在你家里，为你的两个女儿服事你十四年，为你的羊群服事你六年，你又十次改了我的工价。\n" +
                    "创31:42 若不是我父亲以撒所敬畏的神，就是亚伯拉罕的打发我空手而去。神看见我的苦情和我的劳碌，就在昨夜责备你。"},
            {"28","圣经记载约瑟年轻时做了几个梦？","4","3","2","1","2","正确答案：两个\n创37:5 约瑟作了一梦，告诉他哥哥们，他们就越发恨他。\n" +
                    "创37:6 约瑟对他们说，请听我所作的梦，\n" +
                    "创37:7 我们在田里捆禾稼，我的捆起来站着，你们的捆来围着我的捆下拜。\n" +
                    "创37:8 他的哥哥们回答说，难道你真要作我们的王吗？难道你真要管辖我们吗？他们就因为他的梦和他的话越发恨他。\n" +
                    "创37:9 后来他又作了一梦，也告诉他的哥哥们说，看哪，我又作了一梦，梦见太阳，月亮，与十一个星向我下拜。\n" +
                    "创37:10 约瑟将这梦告诉他父亲和他哥哥们，他父亲就责备他说，你作的这是什么梦。难道我和你母亲，你弟兄果然要来俯伏在地，向你下拜吗？\n" +
                    "创37:11 他哥哥们都嫉妒他，他父亲却把这话存在心里。"},
            {"29","约瑟从监里被提出来见埃及法老的时候多少岁？","20","24","26","30","3","正确答案：30岁\n创41:46 约瑟" +
                    "见埃及王法老的时候年三十岁。他从法老面前出去，遍行埃及全地。"},
            {"30","约瑟给法老解梦，预言将要来几个丰收年，几个饥荒年？","七个、七个","七个、十四个","十四个、七个","十四个、十四个","0","正" +
                    "确答案：七个、七个\n创41:29 埃及遍地必来七个大丰年，\n" +
                    "创41:30 随后又要来七个荒年，甚至埃及地都忘了先前的丰收，全地必被饥荒所灭。"},
            {"31","约瑟被卖到埃及，最后在第几个饥荒年和他的哥哥相认？","1","2","3","4","1","正确" +
                    "答案：2\n创45:6 现在这地的饥荒已经二年了，还有五年不能耕种，不能收成。"},
            {"32","当年约瑟当埃及宰相的时候给埃及地定下规矩，每年人民应纳多少税？","十分之一","七分之一","五分之一","二分之一","2","正确答案：" +
                    "五分之一\n创47:24 后来打粮食的时候，你们要把五分之一纳给法老，四分可以归你们作地里的种子，也作你们和你们家口孩童的食物。\n" +
                    "创47:25 他们说，你救了我们的性命。但愿我们在我主眼前蒙恩，我们就作法老的仆人。\n" +
                    "创47:26 于是约瑟为埃及地定下常例，直到今日，法老必得五分之一，惟独祭司的地不归法老。"},
            {"33","雅各一共活了多少岁？","144","145","146","147","3","正确答案：一百四十七岁\n" +
                    "创47:28 雅各住在埃及地十七年，雅各平生的年日是一百四十七岁。"},
            {"34","雅各在埃及一共住了多少年就死了？","17","18","19","20","0","正确答案：17年\n" +
                    "创47:28 雅各住在埃及地十七年，雅各平生的年日是一百四十七岁。"},
            {"35","雅各死后埃及人为他哀哭了多少天？","100天","70天","30天","10天","1","正确答案：70天\n" +
                    "创50:3 薰尸的常例是四十天。那四十天满了，埃及人为他哀哭了七十天。"},
            {"36","约瑟一共活了多少岁？","90岁","100岁","110岁","120岁","2","正确答案：110岁\n" +
                    "创50:26 约瑟死了，正一百一十岁。人用香料将他薰了，把他收殓在棺材里，停在埃及。"},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},


    };
    //将问题数组String listshuzi 添加进list中
    public  List<DbShuZiTiBianLiang> AddQuestionShuZi(){
        List<DbShuZiTiBianLiang> list1=new ArrayList<>();


            for(int i=0;i<listShuzi.length;i++){

                DbShuZiTiBianLiang bianliang=new DbShuZiTiBianLiang();
                //获得问题的序号、标题、选项、正确答案及解析
                bianliang.DingyiId=Integer.parseInt(listShuzi[i][0]);
                bianliang.Dingyique=listShuzi[i][1];
                bianliang.DingyiA=listShuzi[i][2];
                bianliang.DingyiB=listShuzi[i][3];
                bianliang.DingyiC=listShuzi[i][4];
                bianliang.DingyiD=listShuzi[i][5];
                //QueRightAnswer的值应该在0-3之间，分别对应ABCD
                bianliang.DingyiRightanswer= Integer.parseInt(listShuzi[i][6]);
                bianliang.DingyiExplain=listShuzi[i][7];
                bianliang.DingyiSelectedAnswer=-1;
                list1.add(bianliang);
            }

        return list1;

    }

    //传入参数，生成不重复的随机数组，参数l为所有数据库中问题的个数，request为想要的题目数，
    // 返回的ret为不重复的随机数组
    public int[]  GetRandomNumber(int l,int request){
        Random q=new Random();
        int []no=new int[l];
        int []ret=new int[request];

        for(int i=0;i<l;i++) {
            no[i] = i;
        }

        int end=l-1;
        for(int i=0;i<request;i++){
            int a=q.nextInt(end+1);
            ret[i]=no[a];
            no[a]=no[end];
            end--;

        }

        return ret;
    }
    //调用此方法可以在不遍历数据库的前提下获得数据库中问题的个数
    public int AddQueShuZiLen(){
        return listShuzi.length;
    }

}
