package com.example.Question;

import com.example.Db.DbShuZiTiBianLiang;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by qxx on 2017/5/23.
 */

public class QueTianKong {

    public String listTianKong[][]={


            {"0","起初，___创造天地。","神","道","耶稣","天使","0","正确答案：神\n创1:1 起初，神创造天地。"},
            {"1","太初有__，__与__同在,__就是__","道、神、道、道、神","道、道、神、道、神","道、道、神、神、" +
                    "道","神、神、道、道、神","1","约翰福音1:1\n太初有道，道与神同在，道就是神"},
            {"2","神就照着自己的形像造人，乃是照着他的形像造男造女。 神就赐福给他们，又对他们说，要__、__、__。" +
                    "也要管理海里的鱼，空中的鸟，和地上各样行动的活物。","遍满地面，生养众多，治理这地","治理" +
                    "这地，生养众多，遍满地面","生养众多，遍满地面，治理这地","遍满地面，治理这地，生养众" +
                    "多","2","创1:28 神就赐福给他们，又对他们说，要生养众多，遍满地面，治理这地。也" +
                    "要管理海里的鱼，空中的鸟，和地上各样行动的活物。"},
            {"3","耶和华神使各样的树从地里长出来，可以悦人的眼目，其上的果子好作食物。园子当中又有___和分别善恶的" +
                    "树。","智慧树","知识树","医治","生命树","3","正确答案：生命树\n创2:9 耶和华神" +
                    "使各样的树从地里长出来，可以悦人的眼目，其上的果子好作食物。园子当中又有生命树和分别善恶的树。"},
            {"4"," 耶和华神说，那人独居不好，我要为他造一个配偶__他。","帮助","陪","辅助","安慰","0","正确答案：帮助\n创2:18 耶和" +
                    "华神说，那人独居不好，我要为他造一个配偶帮助他。"},
            {"5"," 耶和华神所造的，惟有__比田野一切的活物更狡猾。","猴子","蛇","狐狸","龙","1","正确答案：蛇\n" +
                    "创3:1 耶和华神所造的，惟有蛇比田野一切的活物更狡猾。"},
            {"6"," 我又要叫你和女人彼此为仇。你的后裔和女人的后裔也彼此为仇。女人的后裔要伤你的__，你要伤他" +
                    "的__。","头、头","脚跟、脚跟","头、脚跟","脚跟、头","2","正确答案：头、脚跟\n" +
                    "创3:15 我又要叫你和女人彼此为仇。你的后" +
                    "裔和女人的后裔也彼此为仇。女人的后裔要伤你的头，你要伤他的脚跟。"},
            {"7","你若行得好，岂不蒙悦纳，你若行得不好，__就伏在门前。它必恋慕你，你却要制伏它。","恶","死","嫉妒","罪","3","正确答案：罪\n" +
                    "创4:7 你若行得好，岂不蒙悦纳，你若行得不好，罪就伏在门前。它必恋慕你，你却要制伏它。"},
            {"8","神的儿子们看见人的女子美貌，就随意挑选，娶来为妻。耶和华说，人既属乎__，我的灵就不永远住在他" +
                    "里面。然而他的日子还可到一百二十年。","血气","肉体","情欲","败坏","0","正确答案：血气\n创6:2 神的儿子们看见人的女子美貌，就随意挑选，娶来为妻。\n" +
                    "创6:3 耶和华说，人既属乎血气，我的灵就不永远" +
                    "住在他里面。然而他的日子还可到一百二十年。"},
            {"9","他又等了七天，再把鸽子从方舟放出去。到了晚上，鸽子回到他那里，嘴里叼着一个新拧下来的__叶子，挪亚就知道地" +
                    "上的水退了。","棕树","橄榄","葡萄树","无花果","1","正确答案：橄榄\n创8:11 到了晚上，鸽子回到他" +
                    "那里，嘴里叼着一个新拧下来的橄榄叶子，挪亚就知道地上的水退了。"},
            {"10","凡活着的动物，都可以作你们的食物。这一切我都赐给你们，如同菜蔬一样。惟独肉带着__，那就是它的生命，你们不可" +
                    "吃。","骨头","皮","血","血管","2","正确答案：血\n创9:3 凡活着的动物，都可以作你们的食物。这一切我都赐给你们，如同菜蔬一样。\n" +
                    "创9:4 惟独肉带着血，那就是它的生命，你们不可吃。"},
            {"11","耶和华对亚伯兰说，你要离开__,__,__，往我所要指示你的地去。","本族、本地、父家","本地、父家、本族","父家、本地、本" +
                    "族","本地、本族、父家","3","正确答案：本地、本族、父家\n创12:1 耶和华对亚伯兰说，你要离开本地，本族，父家，往我所要指示你的地去。\n" +
                    "创12:2 我必叫你成为大国，我必赐福给你，叫你的名为大，你也要叫别人得福。"},
            {"12","流你们血，害你们命的，无论是__，是__，我必讨他的罪，就是向各人的弟兄也是如此。","兽、人","人、兽","野兽、恶人","恶人、野兽","0","正确答案：兽、人\n创9:5 流你们血，害你们命的，无论是兽，是人，我必讨他的罪，就是向各人的弟兄也是如此。"},
            {"13","神说，我与你们并你们这里的各样活物所立的永约，是有记号的。我把___放在云彩中，这就可作我与地立约的记号了。","雷","虹","闪电","雨","1","正确答案：虹\n创9:12 神说，我与你们并你们这里的各样活物所立的永约，是有记号的。\n" +
                    "创9:13 我把虹放在云彩中，这就可作我与地立约的记号了。"},
            {"14","（巴别塔的故事）他们说，来吧，我们要建造一座城和一座塔，塔顶通天，为要___，免得我们分散在全地上。","使我们聚在一起","成为我们的标志","传扬我们的名","使我们能看很远","2","正确答案：传扬我们的名\n创11:4 他们说，来吧，我们要建造一座城和一座塔，塔顶通天，为要传扬我们的名，免得我们分散在全地上。"},
            {"15","亚伯兰住在迦南地，罗得住在平原的城邑，渐渐挪移帐棚，直到___。","迦南","约旦河","所多玛","蛾摩拉","2","正确答案：所多玛\n创13:12 亚伯兰住在迦南地，罗得住在平原的城邑，渐渐挪移帐棚，直到所多玛。"},
            {"16","又有撒冷王麦基洗德带着__和__出来迎接。他是至高神的祭司。","蜂蜜、饼","酒、油","鲜花、礼物","饼、酒","3","正确答案：饼、酒\n创14:18 又有撒冷王麦基洗德带着饼和酒出来迎接。他是至高神的祭司。"},
            {"17","亚伯兰__耶和华，耶和华就以此为他的__。","信、义","信、善","顺服、义","顺服、善","0","正确答案：信、义\n创15:6 亚伯兰信耶和华，耶和华就以此为他的义。"},
            {"18","耶和华的使者在旷野书珥路上的水泉旁遇见她，对她说，撒莱的使女夏甲，__，__。","你从哪里来、去做什么","你从哪里来、要往哪里去","你往哪里去、去那里做什么","你是谁、从哪里来","1","正确答案：你从哪里来、要往哪里去\n创16:7 耶和华的使者在旷野书珥路上的水泉旁遇见她，\n" +
                    "创16:8 对她说，撒莱的使女夏甲，你从哪里来，要往哪里去。"},
            {"19","亚伯兰年九十九岁的时候，耶和华向他显现，对他说，我是全能的神。你当在我面前作__","义人","好人","完全人","顺服人","2","正确答案：完全人\n创17:1 亚伯兰年九十九岁的时候，耶和华向他显现，对他说，我是全能的神。你当在我面前作完全人，\n" +
                    "创17:2 我就与你立约，使你的后裔极其繁多。"},
            {"20","神又对亚伯拉罕说，你和你的后裔，必世世代代遵守我的约。你们所有的男子，都要__。这就是我与你，并你的后裔所立的约，是你们所当遵守的。","服侍我","敬拜我","受印记","受割礼","3","创17:9 神又对亚伯拉罕说，你和你的后裔，必世世代代遵守我的约。\n" +
                    "创17:10 你们所有的男子，都要受割礼。这就是我与你，并你的后裔所立的约，是你们所当遵守的。"},
            {"21","耶和华说，我若在所多玛城里见有五十个义人，我就为他们的缘故__那地方的众人。","饶恕","宽恕","原谅","放过","0","正确答案：饶恕\n创18:26 耶和华说，我若在所多玛城里见有五十个义人，我就为他们的缘故饶恕那地方的众人。"},
            {"22","受患难的人，为何有__赐给他呢？心中愁苦的人，为何有__赐给他呢？（约伯记） ","智慧、力量","光、生" +
                    "命","聪明、智慧","苦水、气息","1","正确答案：光、生命\n伯3:20 受患难的人，为何有光赐给他呢？心中愁苦的人，为何有生命赐给他呢？"},
            {"23","请你追想，__的人有谁灭亡？__的人在何处剪除？（约伯记）","公义、公平","智慧、聪明","无辜、正直","少壮、年幼","2","正确答案：无辜、正直\n" +
                    "伯4:7 请你追想，无辜的人有谁灭亡。正直的人在何处剪除。"},
            {"24","__害死愚妄人，__杀死痴迷人。（约伯记）","愚顽、痴迷","咒诅、恶毒","灾祸、恼恨","忿怒、嫉妒","3","正确答案：忿怒、嫉妒\n伯5:2 忿怒害死愚妄人，嫉妒杀死痴迷人。"},
            {"25","神拯救__人，脱离他们口中的刀，和强暴人的手。（约伯记）","穷乏","恶","愚昧","无知","0","正确答案：穷乏\n" +
                    "伯5:15 神拯救穷乏人，脱离他们口中的刀，和强暴人的手。"},
            {"26","你__次遭难，他必救你。就是__次，灾祸也无法害你。（约伯记）","三、四","六、七","十二、十三","四十九、五十","1","正确答案：六、七\n" +
                    "伯5:17 神所惩治的人是有福的。所以你不可轻看全能者的管教。\n" +
                    "伯5:18 因为他打破，又缠裹。他击伤，用手医治。\n" +
                    "伯5:19 你六次遭难，他必救你。就是七次，灾祸也无法害你"},
            {"27","你在世的日子要比__更明，虽有黑暗，仍像早晨。","太阳","月亮","正午","晨光","2","正确答案：正午" +
                    "\n伯11:13 你若将心安正，又向主举手。\n" +
                    "伯11:14 你手里若有罪孽，就当远远地除掉，也不容非义住在你帐棚之中。\n" +
                    "伯11:15 那时，你必仰起脸来毫无斑点。你也必坚固，无所惧怕。\n" +
                    "伯11:16 你必忘记你的苦楚，就是想起也如流过去的水一样。\n" +
                    "伯11:17 你在世的日子要比正午更明，虽有黑暗，仍像早晨。"},
            {"28","__岂不试验__，正如上膛尝食物吗？（约伯记）","神、人","魔鬼、人","鼻子、气味","耳朵、言语","3","正确答案：耳朵、言语\n" +
                    "伯12:11 耳朵岂不试验言语，正如上膛尝食物吗？"},
            {"29","__的有智慧，__的有知识。（约伯记）","年老、寿高","阅历多、见识广","智慧、聪明","完全、正直","0","正确答案：年老、寿高\n" +
                    "伯12:12 年老的有智慧，寿高的有知识。"},
            {"30","人为妇人所生，日子短少，多有__。（约伯记）","愁苦","患难","灾祸","逆境","1","正确答案：患难\n" +
                    "伯14:1 "},
            {"31","你要认识神，就得__，福气也必临到你。（约伯记）",
                    "好处","力量","平安","福气",
                    "2","正确答案：平安\n伯22:21 你要认识神，就得平安。福气也必临到你。\n" +
                    "伯22:22 你当领受他口中的教训，将他的言语存在心里。"},
            {"32","然而人仆倒，岂不__？遇灾难，岂不求救呢？（约伯记）",
                    "疼痛","躺下","起来","伸手",
                    "3","正确答案：伸手\n伯30:24 然而人仆倒，岂不伸手？遇灾难，岂不求救呢？"},
            {"33","亮光不照恶人，强横的__也必折断。（约伯记）","膀臂","大腿","杖","木棍",
                    "0","正确答案：膀臂\n伯38:15 亮光不照恶人，强横的膀臂也必折断。"},
            {"34","伯38:25 谁为雨水分道？谁为雷电开路？使雨降在无人之地，无人居住的旷野，使荒废凄凉之地得以丰足，___得以发生。（约伯记）",
                    "树木","青草","庄稼","雨露",
                    "1","正确答案：青草\n伯38:25 谁为雨水分道？谁为雷电开路？\n" +
                    "伯38:26 使雨降在无人之地，无人居住的旷野？\n" +
                    "伯38:27 使荒废凄凉之地得以丰足，青草得以发生？"},
            {"35","那时，__一同歌唱，神的众子也都欢呼。（约伯记）",
                    "太阳","月亮","晨星","穹苍",
                    "2","正确答案：晨星\n伯38:4 我立大地根基的时候，你在哪里呢？你若有聪明，只管说吧。\n" +
                    "伯38:5 你若晓得就说，是谁定地的尺度？是谁把准绳拉在其上？\n" +
                    "伯38:6 地的根基安置在何处？地的角石是谁安放的？\n" +
                    "伯38:7 那时晨星一同歌唱，神的众子也都欢呼。"},
            {"36","伯40:1 耶和华又对约伯说：“强辩的岂可与全能者争论吗？与神辩驳的，可以__这些吧！”",
                    "解释","相信","明白","回答",
                    "3","正确答案：回答\n伯40:1 耶和华又对约伯说，\n" +
                    "伯40:2 强辩的岂可与全能者争论吗？与神辩驳的可以回答这些吧。"},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},
//            {"","","","","","","",""},

    };
    //将问题数组String listTianKong 添加进list中
    public List<DbShuZiTiBianLiang> AddQuestionTianKong(){
        List<DbShuZiTiBianLiang> list1=new ArrayList<>();


        for(int i=0;i<listTianKong.length;i++){

            DbShuZiTiBianLiang bianliang=new DbShuZiTiBianLiang();
            //获得问题的序号、标题、选项、正确答案及解析
            bianliang.DingyiId=Integer.parseInt(listTianKong[i][0]);
            bianliang.Dingyique=listTianKong[i][1];
            bianliang.DingyiA=listTianKong[i][2];
            bianliang.DingyiB=listTianKong[i][3];
            bianliang.DingyiC=listTianKong[i][4];
            bianliang.DingyiD=listTianKong[i][5];
            //QueRightAnswer的值应该在0-3之间，分别对应ABCD
            bianliang.DingyiRightanswer= Integer.parseInt(listTianKong[i][6]);
            bianliang.DingyiExplain=listTianKong[i][7];
            bianliang.DingyiSelectedAnswer=-1;
            list1.add(bianliang);
        }

        return list1;

    }

    //    //传入参数，生成随机数组，参数l为所有数据库中问题的个数
//    public int  GetRandomNumber(int l){
//        Random q=new Random();
//        int a=q.nextInt(l);
//        return a;
//    }
    //调用此方法可以在不遍历数据库的前提下获得数据库中问题的个数
    public int AddQueTianKongLen(){
        return listTianKong.length;
    }
}
